#pragma once

#include "nativecommon.h"

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

#define LEVEL_MASK 3

//
// Push lock definitions
//
typedef struct _EX_PUSH_LOCK {
    //
    // LOCK bit is set for both exclusive and shared acquires
    //
#define EX_PUSH_LOCK_LOCK_V          ((ULONG_PTR)0x0)
#define EX_PUSH_LOCK_LOCK            ((ULONG_PTR)0x1)
    //
    // Waiting bit designates that the pointer has chained waiters
    //
#define EX_PUSH_LOCK_WAITING         ((ULONG_PTR)0x2)
    //
    // Waking bit designates that we are either traversing the list
    // to wake threads or optimizing the list
    //
#define EX_PUSH_LOCK_WAKING          ((ULONG_PTR)0x4)
    //
    // Set if the lock is held shared by multiple owners and there are waiters
    //
#define EX_PUSH_LOCK_MULTIPLE_SHARED ((ULONG_PTR)0x8)
    //
    // Total shared Acquires are incremented using this
    //
#define EX_PUSH_LOCK_SHARE_INC       ((ULONG_PTR)0x10)
#define EX_PUSH_LOCK_PTR_BITS        ((ULONG_PTR)0xf)
    union {
        struct {
            ULONG_PTR Locked : 1;
            ULONG_PTR Waiting : 1;
            ULONG_PTR Waking : 1;
            ULONG_PTR MultipleShared : 1;
            ULONG_PTR Shared : sizeof( ULONG_PTR ) * 8 - 4;
        };
        ULONG_PTR Value;
        PVOID Ptr;
    };
} EX_PUSH_LOCK, *PEX_PUSH_LOCK;

typedef struct _EX_PUSH_LOCK64 {
    union {
        struct {
            ULONGLONG Locked : 1;
            ULONGLONG Waiting : 1;
            ULONGLONG Waking : 1;
            ULONGLONG MultipleShared : 1;
            ULONGLONG Shared : sizeof( ULONGLONG ) * 8 - 4;
        };
        ULONGLONG Value;
        ULONGLONG Ptr; // PVOID
    };
} EX_PUSH_LOCK64, *PEX_PUSH_LOCK64;

//
// Rundown protection structure
//
typedef struct _EX_RUNDOWN_REF {
#define EX_RUNDOWN_ACTIVE      0x01
#define EX_RUNDOWN_COUNT_SHIFT 0x01
#define EX_RUNDOWN_COUNT_INC   (1 << EX_RUNDOWN_COUNT_SHIFT)
    union {
        ULONG_PTR Count;
        PVOID Ptr;
    };
} EX_RUNDOWN_REF, *PEX_RUNDOWN_REF;

typedef struct _EX_RUNDOWN_REF64 {
    union {
        ULONGLONG Count;
        ULONGLONG Ptr;  // PVOID
    };
} EX_RUNDOWN_REF64, *PEX_RUNDOWN_REF64;

//
// Executive Fast Reference Structure
//
typedef struct _EX_FAST_REF {
    union {
        PVOID Object;
        ULONG_PTR RefCnt : 3;
        ULONG_PTR Value;
    };
} EX_FAST_REF, *PEX_FAST_REF;

typedef struct _EX_FAST_REF64 {
    union {
        ULONGLONG Object;           // PVOID
        ULONGLONG RefCnt : 3;
        ULONGLONG Value;
    };
} EX_FAST_REF64, *PEX_FAST_REF64;


//
// Absolute maximum number of handles allowed
//
#define MAX_HANDLES         (1 << 24)

#define LOWLEVEL_COUNT      (PAGE_SIZE / sizeof( HANDLE_TABLE_ENTRY ))
#define MIDLEVEL_COUNT      (PAGE_SIZE / sizeof( PHANDLE_TABLE_ENTRY ))
#define HIGHLEVEL_COUNT     MAX_HANDLES / (LOWLEVEL_COUNT * MIDLEVEL_COUNT)

#define HANDLE_TAG_BITS     (2)
#define HANDLE_INDEX_BITS   (30)

//
//  The Ex/Ob handle table package uses a common handle definition. The actual
//  type definition for a handle is a pvoid and is declared in sdk/inc. This
//  package uses only the low 32 bits of the pvoid pointer.
//
//  For simplicity we declare a new typedef called an exhandle
//
//  The 2 bits of an EXHANDLE is available to the application and is
//  ignored by the system.  The next 24 bits store the handle table entry
//  index and is used to refer to a particular entry in a handle table.
//
//  Note that this format is immutable because there are outside programs with
//  hardwired code that already assumes the format of a handle.
//
typedef struct _EXHANDLE {
    union {
        struct {
            //
            //  Application available tag bits
            //
            ULONG TagBits : HANDLE_TAG_BITS;
            //
            //  The handle table entry index
            //
            ULONG Index : HANDLE_INDEX_BITS;
       };
        HANDLE GenericHandleOverlay;
#define HANDLE_VALUE_INC 4 // Amount to increment the Value to get to the next handle
        ULONG_PTR Value;
    };
} EXHANDLE, *PEXHANDLE;

typedef union _EXHANDLE64 {
    struct {
        ULONG TagBits : HANDLE_TAG_BITS;
        ULONG Index : HANDLE_INDEX_BITS;
    };
    ULONGLONG GenericHandleOverlay; // HANDLE
    ULONGLONG Value;                // ULONG_PTR
} EXHANDLE64, *PEXHANDLE64;

typedef struct _HANDLE_TABLE_ENTRY_INFO {
    ULONG AuditMask;                                        // 0x00
    ULONG MaxRelativeAccessMask;                            // 0x04
} HANDLE_TABLE_ENTRY_INFO, *PHANDLE_TABLE_ENTRY_INFO;

typedef struct _HANDLE_TABLE_ENTRY {
    union {
        struct {
            union {
                volatile LONGLONG VolatileLowValue;         // 0x00
                LONGLONG LowValue;                          // 0x00
                PHANDLE_TABLE_ENTRY_INFO InfoTable;         // 0x00
            };
            union {
                LONGLONG HighValue;                         // 0x08
                struct _HANDLE_TABLE_ENTRY *NextFreeHandleEntry; // 0x08
                EXHANDLE LeafHandleValue;                   // 0x08
            };
        };
        struct {
            union {
                LONGLONG RefCountField;                     // 0x00
                struct {
                    LONGLONG Unlocked : 1;                  // 0x00
                    LONGLONG RefCnt : 16;                   // 0x00
                    LONGLONG Attributes : 3;                // 0x00
                    LONGLONG ObjectPointerBits : 44;        // 0x00
                };
            };
            ULONG GrantedAccessBits : 25;                   // 0x08
            ULONG NoRightsUpgrade : 1;                      // 0x08
            ULONG Spare1 : 6;                               // 0x08
            ULONG Spare2;                                   // 0x0C
        };
    };
} HANDLE_TABLE_ENTRY, *PHANDLE_TABLE_ENTRY;

typedef struct _HANDLE_TABLE_ENTRY64 {
    union {
        struct {
            union {
                volatile LONGLONG VolatileLowValue;         // 0x00
                LONGLONG LowValue;                          // 0x00
                ULONGLONG InfoTable;                        // 0x00 PHANDLE_TABLE_ENTRY_INFO
            };
            union {
                LONGLONG HighValue;                         // 0x08
                ULONGLONG NextFreeHandleEntry;              // 0x08 struct _HANDLE_TABLE_ENTRY *
                EXHANDLE64 LeafHandleValue;                 // 0x08
            };
        };
        struct {
            union {
                LONGLONG RefCountField;                     // 0x00
                struct {
                    LONGLONG Unlocked : 1;                  // 0x00
                    LONGLONG RefCnt : 16;                   // 0x00
                    LONGLONG Attributes : 3;                // 0x00
                    LONGLONG ObjectPointerBits : 44;        // 0x00
                };
            };
            ULONG GrantedAccessBits : 25;                   // 0x08
            ULONG NoRightsUpgrade : 1;                      // 0x08
            ULONG Spare1 : 6;                               // 0x08
            ULONG Spare2;                                   // 0x0C
        };
    };
} HANDLE_TABLE_ENTRY64, *PHANDLE_TABLE_ENTRY64;

typedef struct _HANDLE_TABLE_FREE_LIST {
    EX_PUSH_LOCK FreeListLock;                              // 0x00
    PHANDLE_TABLE_ENTRY FirstFreeHandleEntry;               // 0x08
    PHANDLE_TABLE_ENTRY LastFreeHandleEntry;                // 0x10
    LONG HandleCount;                                       // 0x18
    ULONG HighWaterMark;                                    // 0x1C
} HANDLE_TABLE_FREE_LIST, *PHANDLE_TABLE_FREE_LIST;

typedef struct _HANDLE_TABLE_FREE_LIST64 {
    EX_PUSH_LOCK64 FreeListLock;                            // 0x00
    ULONGLONG FirstFreeHandleEntry;                         // 0x08 PHANDLE_TABLE_ENTRY64
    ULONGLONG LastFreeHandleEntry;                          // 0x10 PHANDLE_TABLE_ENTRY64
    LONG HandleCount;                                       // 0x18
    ULONG HighWaterMark;                                    // 0x1C
} HANDLE_TABLE_FREE_LIST64, *PHANDLE_TABLE_FREE_LIST64;

typedef struct _HANDLE_TRACE_DB_ENTRY {
    CLIENT_ID ClientId;                                     // 0x00
    HANDLE Handle;                                          // 0x10
#define HANDLE_TRACE_DB_OPEN    1
#define HANDLE_TRACE_DB_CLOSE   2
#define HANDLE_TRACE_DB_BADREF  3
    ULONG Type;                                             // 0x18
    PVOID StackTrace[16];                                   // 0x20
} HANDLE_TRACE_DB_ENTRY, *PHANDLE_TRACE_DB_ENTRY;

typedef struct _HANDLE_TRACE_DB_ENTRY64 {
    CLIENT_ID64 ClientId;                                   // 0x00
    ULONGLONG Handle;                                       // 0x10 HANDLE
    ULONG Type;                                             // 0x18
    ULONGLONG StackTrace[16];                               // 0x20 PVOID[16]
} HANDLE_TRACE_DB_ENTRY64, *PHANDLE_TRACE_DB_ENTRY64;

typedef struct _HANDLE_TRACE_DEBUG_INFO {
    LONG RefCount;                                          // 0x00
    ULONG TableSize;                                        // 0x04
    ULONG BitMaskFlags;                                     // 0x08
    FAST_MUTEX CloseCompactionLock;                         // 0x10
    ULONG CurrentStackIndex;                                // 0x48
    HANDLE_TRACE_DB_ENTRY TraceDb[1];                       // 0x50
} HANDLE_TRACE_DEBUG_INFO, *PHANDLE_TRACE_DEBUG_INFO;

typedef struct _HANDLE_TRACE_DEBUG_INFO64 {
    LONG RefCount;                                          // 0x00
    ULONG TableSize;                                        // 0x04
    ULONG BitMaskFlags;                                     // 0x08
    ULONG Spare0;                                           // 0x0C
    FAST_MUTEX64 CloseCompactionLock;                       // 0x10
    ULONG CurrentStackIndex;                                // 0x48
    HANDLE_TRACE_DB_ENTRY64 TraceDb[1];                     // 0x50
} HANDLE_TRACE_DEBUG_INFO64, *PHANDLE_TRACE_DEBUG_INFO64;

typedef struct _HANDLE_TABLE {
    ULONG NextHandleNeedingPool;                            // 0x00
    LONG ExtraInfoPages;                                    // 0x04
    ULONG_PTR TableCode;                                    // 0x08
    struct _EPROCESS *QuotaProcess;                         // 0x10
    LIST_ENTRY HandleTableList;                             // 0x18
    ULONG UniqueProcessId;                                  // 0x28             
    union {
        ULONG Flags;                                        // 0x2C
        struct {
            ULONG StrictFIFO : 1;
            ULONG EnableHandleExceptions : 1;
            ULONG Rundown : 1;
            ULONG Duplicated : 1;
            ULONG RaiseUMExceptionOnInvalidHandleClose : 1;
        };
    };
    EX_PUSH_LOCK HandleContentionEvent;                     // 0x30
    EX_PUSH_LOCK HandleTableLock;                           // 0x38
    union {
        HANDLE_TABLE_FREE_LIST FreeLists[1];                // 0x40
        UCHAR ActualEntry[32];                              // 0x40
    };
    PHANDLE_TRACE_DEBUG_INFO DebugInfo;                     // 0x60
} HANDLE_TABLE, *PHANDLE_TABLE;

typedef struct _HANDLE_TABLE64 {
    ULONG NextHandleNeedingPool;                            // 0x00
    LONG ExtraInfoPages;                                    // 0x04
    ULONGLONG TableCode;                                    // 0x08 ULONG_PTR
    ULONGLONG QuotaProcess;                                 // 0x10 PEPROCESS
    LIST_ENTRY64 HandleTableList;                           // 0x18
    ULONG UniqueProcessId;                                  // 0x28             
    union {
        ULONG Flags;                                        // 0x2C
        struct {
            ULONG StrictFIFO : 1;
            ULONG EnableHandleExceptions : 1;
            ULONG Rundown : 1;
            ULONG Duplicated : 1;
            ULONG RaiseUMExceptionOnInvalidHandleClose : 1;
        };
    };
    EX_PUSH_LOCK64 HandleContentionEvent;                   // 0x30
    EX_PUSH_LOCK64 HandleTableLock;                         // 0x38
    union {
        HANDLE_TABLE_FREE_LIST64 FreeLists[1];              // 0x40
        UCHAR ActualEntry[32];                              // 0x40
    };
    ULONGLONG DebugInfo;                                    // 0x60 PHANDLE_TRACE_DEBUG_INFO64
} HANDLE_TABLE64, *PHANDLE_TABLE64;


//
// Extended processor state configuration
//

typedef struct _XSTATE_CONFIGURATION_EXTENDED {
    // Mask of all enabled features
    ULONG64 EnabledFeatures;

    // Mask of volatile enabled features
    ULONG64 EnabledVolatileFeatures;

    // Total size of the save area for user states
    ULONG Size;

    // Control Flags
    union {
        ULONG ControlFlags;
        struct {
            ULONG OptimizedSave : 1;
            ULONG CompactionEnabled : 1;
        };
    };

    // List of features
    XSTATE_FEATURE Features[MAXIMUM_XSTATE_FEATURES];

    // Mask of all supervisor features
    ULONG64 EnabledSupervisorFeatures;

    // Mask of features that require start address to be 64 byte aligned
    ULONG64 AlignedFeatures;

    // Total size of the save area for user and supervisor states
    ULONG AllFeatureSize;

