#pragma once

#include "nativecommon.h"
#include "nativemm.h"
#include "nativeinfo.h"

#ifdef __cplusplus
extern "C" {
#endif // __cplusplus

///
/// < RTL Macros and Definitions >
///

#define NTRTLAPI NTSYSAPI

// Common
#define RTL_MAX_DRIVE_LETTERS                               32
#define RTL_DRIVE_LETTER_VALID                              ((USHORT)0x0001)

#define RTL_CONSTANT_OBJECT_ATTRIBUTES(n, a) { sizeof(OBJECT_ATTRIBUTES), NULL, n, a, NULL, NULL }
#define RTL_INIT_OBJECT_ATTRIBUTES(n, a) RTL_CONSTANT_OBJECT_ATTRIBUTES(n, a)

// String
#define RTL_CONSTANT_STRING(s) { sizeof(s) - sizeof((s)[0]), sizeof(s), s }

#define RTL_DUPLICATE_UNICODE_STRING_NULL_TERMINATE         (0x00000001) 
#define RTL_DUPLICATE_UNICODE_STRING_ALLOCATE_NULL_STRING   (0x00000002)

#define HASH_STRING_ALGORITHM_DEFAULT                       (0)
#define HASH_STRING_ALGORITHM_X65599                        (1)
#define HASH_STRING_ALGORITHM_INVALID                       (0xFFFFFFFF)

#define RTL_FIND_CHAR_IN_UNICODE_STRING_START_AT_END        (0x00000001)
#define RTL_FIND_CHAR_IN_UNICODE_STRING_COMPLEMENT_CHAR_SET (0x00000002)
#define RTL_FIND_CHAR_IN_UNICODE_STRING_CASE_INSENSITIVE    (0x00000004)

// Process
#define RTL_USER_PROC_PARAMS_NORMALIZED                     (0x00000001)
#define RTL_USER_PROC_PROFILE_USER                          (0x00000002)
#define RTL_USER_PROC_PROFILE_KERNEL                        (0x00000004)

#define HEAP_CLASS_3                                        (0x00003000) // GDI heap
#define HEAP_CLASS_4                                        (0x00004000) // User heap
#define HEAP_CLASS_5                                        (0x00005000) // Console heap
#define HEAP_CLASS_6                                        (0x00006000) // User desktop heap
#define HEAP_CLASS_7                                        (0x00007000) // CSR shared heap
#define HEAP_CLASS_8                                        (0x00008000) // CSR port heap
#define HEAP_CLASS_MASK                                     (0x0000F000)

#define RTL_HEAP_MAKE_TAG HEAP_MAKE_TAG_FLAGS
#define HEAP_USAGE_ALLOCATED_BLOCKS HEAP_REALLOC_IN_PLACE_ONLY
#define HEAP_USAGE_FREE_BUFFER HEAP_ZERO_MEMORY

#define HeapDebuggingInformation                            (0x80000002)

// Error
#define RTL_ERRORMODE_NOGPFAULTERRORBOX                     (0x0020)
#define RTL_ERRORMODE_NOOPENFILEERRORBOX                    (0x0040)

// Debugging
#define RTL_QUERY_PROCESS_MODULES                           (0x00000001)
#define RTL_QUERY_PROCESS_BACKTRACES                        (0x00000002)
#define RTL_QUERY_PROCESS_HEAP_SUMMARY                      (0x00000004)
#define RTL_QUERY_PROCESS_HEAP_TAGS                         (0x00000008)
#define RTL_QUERY_PROCESS_HEAP_ENTRIES                      (0x00000010)
#define RTL_QUERY_PROCESS_LOCKS                             (0x00000020)
#define RTL_QUERY_PROCESS_MODULES32                         (0x00000040)
#define RTL_QUERY_PROCESS_VERIFIER_OPTIONS                  (0x00000080) 
#define RTL_QUERY_PROCESS_MODULESEX                         (0x00000100) 
#define RTL_QUERY_PROCESS_HEAP_ENTRIES_EX                   (0x00000200) 
#define RTL_QUERY_PROCESS_CS_OWNER                          (0x00000400)
#define RTL_QUERY_PROCESS_NONINVASIVE                       (0x80000000)

#define DBG_STATUS_CONTROL_C                                (1)
#define DBG_STATUS_SYSRQ                                    (2)
#define DBG_STATUS_BUGCHECK_FIRST                           (3)
#define DBG_STATUS_BUGCHECK_SECOND                          (4)
#define DBG_STATUS_FATAL                                    (5)
#define DBG_STATUS_DEBUG_CONTROL                            (6)
#define DBG_STATUS_WORKER                                   (7)

///
/// < RTL Enums >
///

typedef enum _RTL_NORM_FORM {
    NormOther = 0x0,
    NormC = 0x1,
    NormD = 0x2,
    NormKC = 0x5,
    NormKD = 0x6,
    NormIdna = 0xd,
    DisallowUnassigned = 0x100,
    NormCDisallowUnassigned = 0x101,
    NormDDisallowUnassigned = 0x102,
    NormKCDisallowUnassigned = 0x105,
    NormKDDisallowUnassigned = 0x106,
    NormIdnaDisallowUnassigned = 0x10d
} RTL_NORM_FORM;

typedef enum _RTL_PATH_TYPE {
    RtlPathTypeUnknown,
    RtlPathTypeUncAbsolute,
    RtlPathTypeDriveAbsolute,
    RtlPathTypeDriveRelative,
    RtlPathTypeRooted,
    RtlPathTypeRelative,
    RtlPathTypeLocalDevice,
    RtlPathTypeRootLocalDevice
} RTL_PATH_TYPE;


///
/// < RTL Structures >
///

typedef struct _RTL_DRIVE_LETTER_CURDIR {
    USHORT Flags;
    USHORT Length;
    ULONG TimeStamp;
    UNICODE_STRING sPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR;

typedef struct _RTL_DRIVE_LETTER_CURDIR32 {
    USHORT Flags;
    USHORT Length;
    ULONG TimeStamp;
    STRING32 DosPath;
} RTL_DRIVE_LETTER_CURDIR32, *PRTL_DRIVE_LETTER_CURDIR32;

typedef struct _RTLP_CURDIR_REF {
    LONG RefCount;
    HANDLE Handle;
} RTLP_CURDIR_REF;
typedef struct _RTLP_CURDIR_REF *PRTLP_CURDIR_REF;

typedef struct _RTL_RELATIVE_NAME_U {
    UNICODE_STRING RelativeName;
    HANDLE ContainingDirectory;
    PRTLP_CURDIR_REF CurDirRef;
} RTL_RELATIVE_NAME_U, *PRTL_RELATIVE_NAME_U;

//
// Loader
//
typedef struct _RTL_PROCESS_MODULE_INFORMATION {
    HANDLE Section;
    PVOID MappedBase;
    PVOID ImageBase;
    ULONG ImageSize;
    ULONG Flags;
    USHORT LoadOrderIndex;
    USHORT InitOrderIndex;
    USHORT LoadCount;
    USHORT OffsetToFileName;
    UCHAR FullPathName[256];
} RTL_PROCESS_MODULE_INFORMATION, *PRTL_PROCESS_MODULE_INFORMATION;

typedef struct _RTL_PROCESS_MODULE_INFORMATION64 {
    ULONGLONG Section;          // 0x00
    ULONGLONG MappedBase;       // 0x08
    ULONGLONG ImageBase;        // 0x10
    ULONG ImageSize;            // 0x18
    ULONG Flags;                // 0x1C
    USHORT LoadOrderIndex;      // 0x20
    USHORT InitOrderIndex;      // 0x22
    USHORT LoadCount;           // 0x24
    USHORT OffsetToFileName;    // 0x26
    UCHAR FullPathName[256];    // 0x28
} RTL_PROCESS_MODULE_INFORMATION64, *PRTL_PROCESS_MODULE_INFORMATION64;

typedef struct _RTL_PROCESS_MODULES {
    ULONG NumberOfModules;
    RTL_PROCESS_MODULE_INFORMATION Modules[1];
} RTL_PROCESS_MODULES, *PRTL_PROCESS_MODULES;

typedef struct _RTL_PROCESS_MODULES64 {
    ULONG NumberOfModules;
    RTL_PROCESS_MODULE_INFORMATION64 Modules[1];
} RTL_PROCESS_MODULES64, *PRTL_PROCESS_MODULES64;

//
// Compression
//
typedef struct _COMPRESSED_DATA_INFO {
    USHORT CompressionFormatAndEngine; // COMPRESSION_FORMAT_* and COMPRESSION_ENGINE
    UCHAR CompressionUnitShift;
    UCHAR ChunkShift;
    UCHAR ClusterShift;
    UCHAR Reserved;
    USHORT NumberOfChunks;
    ULONG CompressedChunkSizes[1];
} COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO;

//
// Process 
//
typedef struct _RTLP_PROCESS_REFLECTION_REFLECTION_INFORMATION {
    HANDLE ReflectionProcessHandle;
    HANDLE ReflectionThreadHandle;
    CLIENT_ID ReflectionClientId;
} RTLP_PROCESS_REFLECTION_REFLECTION_INFORMATION, *PRTLP_PROCESS_REFLECTION_REFLECTION_INFORMATION;

typedef struct _RTL_USER_PROCESS_PARAMETERS {
    ULONG MaximumLength;            // 0x00
    ULONG Length;                   // 0x04
    ULONG Flags;                    // 0x08
    ULONG DebugFlags;               // 0x0C
    HANDLE ConsoleHandle;           // 0x10
    ULONG ConsoleFlags;             // 0x18
    HANDLE StdInputHandle;          // 0x20
    HANDLE StdOutputHandle;         // 0x28
    HANDLE StdErrorHandle;          // 0x30
    CURDIR CurrentDirectoryPath;    // 0x38
    UNICODE_STRING DllPath;         // 0x50
    UNICODE_STRING ImagePathName;   // 0x60
    UNICODE_STRING CommandLine;     // 0x70
    PWSTR Environment;              // 0x80
    ULONG StartingPositionLeft;     // 0x88
    ULONG StartingPositionTop;      // 0x8C
    ULONG Width;                    // 0x90
    ULONG Height;                   // 0x94
    ULONG CharWidth;                // 0x98
    ULONG CharHeight;               // 0x9C
    ULONG ConsoleTextAttributes;    // 0xA0
    ULONG WindowFlags;              // 0xA4
    ULONG ShowWindowFlags;          // 0xA8
    UNICODE_STRING WindowTitle;     //
    UNICODE_STRING Desktop;
    UNICODE_STRING ShellInfo;
    UNICODE_STRING RuntimeInfo;
    RTL_DRIVE_LETTER_CURDIR CurrentDirectories[RTL_MAX_DRIVE_LETTERS];
#if (NTDDI_VERSION >= NTDDI_VISTA)
    SIZE_T EnvironmentSize;
#endif
#if (NTDDI_VERSION >= NTDDI_WIN7)
    SIZE_T EnvironmentVersion;
#endif
#if (NTDDI_VERSION >= NTDDI_WIN8)
    PVOID PackageDependencyData;
    ULONG ProcessGroupId;
    ULONG LoaderThreads;
#endif
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS;

typedef struct _RTL_USER_PROCESS_INFORMATION {
    ULONG Size;
    HANDLE Process;
    HANDLE Thread;
    CLIENT_ID ClientId;
    SECTION_IMAGE_INFORMATION ImageInformation;
} RTL_USER_PROCESS_INFORMATION, *PRTL_USER_PROCESS_INFORMATION;


///
/// < Exception handling >
///
#ifdef _WIN64
typedef enum _FUNCTION_TABLE_TYPE {
    RF_SORTED,
    RF_UNSORTED,
    RF_CALLBACK,
    RF_KERNEL_DYNAMIC
} FUNCTION_TABLE_TYPE;

