/**
 * Blackout Driver
 * Copyright (c) 2018-2019 Aidan Khoury. All rights reserved.
 *
 * @file loader.h
 * @author Aidan Khoury (ajkhoury)
 * @date 10/15/2018
 */

#include "loader.h"
#include "apiset.h"

#include "image.h"
#include "file.h"
#include "process.h"
#include "util.h"
#include "mm.h"
#include "codegen.h"

#include "driver.h"
#include "log.h"

#include <ntstrsafe.h>

//
// System images names.
//
#define LDRP_KERNEL_NAME     L"ntoskrnl.exe"
#define LDRP_HAL_NAME        L"hal.dll"
#define LDRP_NETIO_NAME      L"netio.sys"

//
// Mark a HIGHADJ entry as needing an increment if reprocessing.
//
#define LDRP_RELOCATION_INCREMENT   0x1

//
// Mark a HIGHADJ entry as not suitable for reprocessing.
//
#define LDRP_RELOCATION_FINAL       0x2

//
// DLL Main Routine
//
typedef
BOOLEAN
(NTAPI *PDLL_INIT_ROUTINE)(
    IN PVOID DllHandle,
    IN ULONG Reason,
    IN PVOID Context OPTIONAL
    );

//
// The default '.DLL' extension.
//
CONST UNICODE_STRING LdrpApiDefaultExtension = RTL_CONSTANT_STRING(L".DLL");

CONST UNICODE_STRING LdrpSystemRootName = RTL_CONSTANT_STRING(L"\\SystemRoot");

CONST ULONGLONG LdrpApiSetPrefixAPI_ = (ULONGLONG)0x2D004900500041; // L"api-"
CONST ULONGLONG LdrpApiSetPrefixEXT_ = (ULONGLONG)0x2D005400580045; // L"ext-"

//
// LdrpLoadDll path info structures.
//

typedef struct _LDRP_DLL_PATH {
    WCHAR *DllSearchPath;                   // 0x00
    PVOID Reserved0;                        // 0x08
    PVOID Reserved1;                        // 0x10
    ULONG ImplicitPathFlags;                // 0x18
    WCHAR *DllName;                         // 0x20
    PVOID Reserved2[10];                    // 0x28
    ULONG Reserved3;                        // 0x78
    BOOLEAN IsSearchPathAllocated;          // 0x7C
} LDRP_DLL_PATH, *PLDRP_DLL_PATH;           // sizeof 0x80

typedef struct _LDRP_DLL_PATH32 {
    ULONG DllSearchPath;                    // 0x00 WCHAR*
    ULONG Reserved0;                        // 0x04
    ULONG Reserved1;                        // 0x08
    ULONG ImplicitPathFlags;                // 0x0C
    ULONG DllName;                          // 0x10 WCHAR*
    ULONG Reserved2[15];                    // 0x14
} LDRP_DLL_PATH32, *PLDRP_DLL_PATH32;       // sizeof 0x50

typedef struct _LDRP_DLL_PATH_WIN81 {
    WCHAR *DllSearchPath;                   // 0x00
    PVOID Reserved0;                        // 0x08
    ULONG ImplicitPathFlags;                // 0x10
    WCHAR *DllName;                         // 0x18
    PVOID Reserved1;                        // 0x20
} LDRP_DLL_PATH_WIN81, *PLDRP_DLL_PATH_WIN81; // sizeof 0x28

typedef struct _LDRP_DLL_PATH32_WIN81 {
    ULONG DllSearchPath;                    // 0x00 WCHAR*
    ULONG Reserved0;                        // 0x04 PVOID
    ULONG ImplicitPathFlags;                // 0x08
    ULONG DllName;                          // 0x0C WCHAR*
    ULONG Reserved1;                        // 0x10 PVOID
} LDRP_DLL_PATH32_WIN81, *PLDRP_DLL_PATH32_WIN81; // sizeof 0x14

typedef struct _LDRP_DLL_PATH_WIN8 {
    WCHAR *DllSearchPath;                   // 0x00
    WCHAR *DllName;                         // 0x08
    BOOLEAN ImplicitPath;                   // 0x10
    BOOLEAN ExternalSearchPath;             // 0x11
} LDRP_DLL_PATH_WIN8, *PLDRP_DLL_PATH_WIN8; // sizeof 0x18

typedef struct _LDRP_DLL_PATH32_WIN8 {
    ULONG DllSearchPath;                    // 0x00
    ULONG DllName;                          // 0x04
    BOOLEAN ImplicitPath;                   // 0x08
    BOOLEAN ExternalSearchPath;             // 0x09
} LDRP_DLL_PATH32_WIN8, *PLDRP_DLL_PATH32_WIN8; // sizeof 0x0C


//
// Forward Declarations
//

typedef
NTSTATUS
(NTAPI *PUSER_SHELLCODE_START_ROUTINE)(
    PVOID Parameter1,
    PVOID Parameter2,
    PVOID Parameter3
    );
static
NTSTATUS
LdrpExecuteShellcode(
    IN PEPROCESS Process,
    IN BOOLEAN NewThread,
    IN BOOLEAN Wait,
    IN PUSER_SHELLCODE_START_ROUTINE StartRoutine,
    IN PVOID Parameter1 OPTIONAL,
    IN PVOID Parameter2 OPTIONAL,
    IN PVOID Parameter3 OPTIONAL
    );


//
// Private Implementation
//

#define LDRP_IS_POWER_OF_TWO(x) \
    (((x) != 0) && (((x) & ((x)-1)) == 0))

FORCEINLINE
SIZE_T
LdrpAlignToSectionAlignment(
    IN SIZE_T Value,
    IN UINT32 SectionAlignment,
    IN UINT32 FileAlignment
)
{
    //
    // 512 is the minimum valid FileAlignment according to the documentation
    // although ntoskrnl.exe has an alignment of 0x80 in some Windows versions.
    //
